Конфигурация/InformationRegisters/СотрудникиОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиОрганизации</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СостояниеСотрудниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СостояниеСотрудниковОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСотрудникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ВнутренниеПеречни.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ВнутренниеПеречни</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеречнейОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ОснованияВнесенияВПеречень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОснованияВнесенияВПеречень</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнесениеИзмененийВоВнутреннийПеречень</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеречнейОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыСотрудниковОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыСотрудниковОрганизации</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийУдостоверениеЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОрганаВыдавшегоУдостоверениеЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыКадровыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыКадровыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/СостоянияСотрудникаОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияСотрудникаОрганизации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Болезнь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БолезньБезОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВынужденныйПрогул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнениеГосударственныхОбязанностей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВыходныеДниНеОплачиваемые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеВыходныеДниОплачиваемые</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйОтпуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйОтпускНеоплачиваемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Командировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускНаСанаторноКурортноеЛечение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускНеоплачиваемыйПоЗаконодательству</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускНеоплачиваемыйПоРазрешениюРаботодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускОсновной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоБеременностиИРодам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускУчебныйНеоплачиваемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускУчебныйОплачиваемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсутствиеПоНевыясненнымПричинам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтсутствиеССохранениемОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прогул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойНеЗависящийОтРаботодателяИРаботника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойПоВинеРаботника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПростойПоВинеРаботодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаботаВОтпускеПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговорПриостановлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗанятости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятостиСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/CommonModules/РаботаССотрудниками/Ext/Module.bsl
Функция СотрудникиУволены(Организация, Сотрудники, Дата, ВыводитьСообщения = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудники",	 Сотрудники);
	Запрос.УстановитьПараметр("Дата",	  	 Дата);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиОрганизацииСрезПоследних.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.СотрудникиОрганизации.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Сотрудник В (&Сотрудники)) КАК СотрудникиОрганизацииСрезПоследних
		|ГДЕ
		|	СотрудникиОрганизацииСрезПоследних.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)";
	
	Результат = Запрос.Выполнить();
	
	Если ВыводитьСообщения Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Сотрудник %1 уволен.", Выборка.Сотрудник), Выборка.Сотрудник);
		КонецЦикла;
	КонецЕсли;	
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

Функция СотрудникиВОтпускеПоУходуЗаРебенком(Организация, Сотрудники, Дата, ВыводитьСообщения = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудники",	 Сотрудники);
	Запрос.УстановитьПараметр("Дата",	  	 Дата);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СостояниеСотрудниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		|	СостояниеСотрудниковОрганизацийСрезПоследних.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.СостояниеСотрудниковОрганизаций.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Сотрудник В (&Сотрудники)) КАК СостояниеСотрудниковОрганизацийСрезПоследних
		|ГДЕ
		|	(СостояниеСотрудниковОрганизацийСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудникаОрганизации.ОтпускПоБеременностиИРодам)
		|			ИЛИ СостояниеСотрудниковОрганизацийСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудникаОрганизации.ОтпускПоУходуЗаРебенком))";
	
	Результат = Запрос.Выполнить();
	
	Если ВыводитьСообщения Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Сотрудник %1: %2.", Выборка.Сотрудник, Выборка.Состояние), Выборка.Сотрудник);
		КонецЦикла;
	КонецЕсли;	
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

Функция СотрудникиВходятВПеречень(Организация, ВидПеречня, Сотрудники, Дата, Отказ) Экспорт
	
	Результат = Истина;
	
	СотрудникиВходящиеВПеречень = СотрудникиВходящиеВПеречень(Организация, ВидПеречня, Дата);
	
	Если ТипЗнч(Сотрудники) = Тип("СправочникСсылка.Сотрудники") Тогда
		Если СотрудникиВходящиеВПеречень.Найти(Сотрудники, "Сотрудник") = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("Сотрудник %1 не входит в перечень %2 по состоянию на %3",
					Сотрудники,
					ВидПеречня,
					Формат(Дата, "ДФ=dd.MM.yyyy")),,,, Отказ);
			Результат = Ложь;
		КонецЕсли;
		
	Иначе
		Для Каждого Сотрудник Из Сотрудники Цикл
			Если СотрудникиВходящиеВПеречень.Найти(Сотрудник, "Сотрудник") = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					СтрШаблон("Сотрудник %1 не входит в перечень %2 по состоянию на %3",
						Сотрудник,
						ВидПеречня,
						Формат(Дата, "ДФ=dd.MM.yyyy")),,,, Отказ);
				Результат = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СотрудникОтсутсвуетНаРабочемМесте(Организация, Сотрудник, Дата, Отказ) Экспорт 
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник",   Сотрудник);
	Запрос.УстановитьПараметр("Дата",		 Дата);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиОрганизацииСрезПоследних.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ _РаботающиеСотрудники
		|ИЗ
		|	РегистрСведений.СотрудникиОрганизации.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник) КАК СотрудникиОрганизацииСрезПоследних
		|ГДЕ
		|	СотрудникиОрганизацииСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СостояниеСотрудниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		|	СостояниеСотрудниковОрганизацийСрезПоследних.Состояние КАК Состояние
		|ПОМЕСТИТЬ _НеРаботающиеСотрудники
		|ИЗ
		|	РегистрСведений.СостояниеСотрудниковОрганизаций.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Сотрудник = &Сотрудник) КАК СостояниеСотрудниковОрганизацийСрезПоследних
		|ГДЕ
		|	СостояниеСотрудниковОрганизацийСрезПоследних.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудникаОрганизации.Работа)";
	
	Запрос.Выполнить();
	
	Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_РаботающиеСотрудники").ПолучитьДанные().Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Сотрудник %1 не работает в организации %2 на %3",
				Сотрудник,
				Организация,
				Формат(Дата, "ДФ=dd.MM.yyyy")), Сотрудник,,, Отказ);
		Результат = Истина;
				
	Иначе 
		НеРаботающиеСотрудники = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_НеРаботающиеСотрудники").ПолучитьДанные().Выбрать();
		Пока НеРаботающиеСотрудники.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("Сотрудник %1 отсутствует (%2) на %3",
					Сотрудник,
					НеРаботающиеСотрудники.Состояние,
					Формат(Дата, "ДФ=dd.MM.yyyy")), Сотрудник,,, Отказ);
			Результат = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПользовательОтсутствуетНаРабочемМесте(Организация, Пользователь, Дата, Отказ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		ВызватьИсключение "Текущий пользователь не указан";
	КонецЕсли;
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Дата",		  Дата);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ _Сотрудники
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Пользователь = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиОрганизацииСрезПоследних.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ _РаботающиеСотрудники
		|ИЗ
		|	РегистрСведений.СотрудникиОрганизации.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Сотрудник В
		|					(ВЫБРАТЬ
		|						_Сотрудники.Ссылка
		|					ИЗ
		|						_Сотрудники КАК _Сотрудники)) КАК СотрудникиОрганизацииСрезПоследних
		|ГДЕ
		|	СотрудникиОрганизацииСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СостояниеСотрудниковОрганизацийСрезПоследних.Сотрудник КАК Сотрудник,
		|	СостояниеСотрудниковОрганизацийСрезПоследних.Состояние КАК Состояние
		|ПОМЕСТИТЬ _НеРаботающиеСотрудники
		|ИЗ
		|	РегистрСведений.СостояниеСотрудниковОрганизаций.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И Сотрудник В
		|					(ВЫБРАТЬ
		|						_РаботающиеСотрудники.Сотрудник
		|					ИЗ
		|						_РаботающиеСотрудники КАК _РаботающиеСотрудники)) КАК СостояниеСотрудниковОрганизацийСрезПоследних
		|ГДЕ
		|	СостояниеСотрудниковОрганизацийСрезПоследних.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудникаОрганизации.Работа)";
	
	
	Запрос.Выполнить();
	
	Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_Сотрудники").ПолучитьДанные().Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Для пользователя %1 в организации %2 не определён ни один сотрудник.",
				Пользователь,
				Организация), Пользователь,,, Отказ);
		Результат = Истина;
		
	ИначеЕсли Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_РаботающиеСотрудники").ПолучитьДанные().Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Для пользователя %1 в организации %2 не определён ни один работающий на %3 сотрудник.",
				Пользователь,
				Организация,
				Формат(Дата, "ДФ=dd.MM.yyyy")), Пользователь,,, Отказ);
		Результат = Истина;

	Иначе
		НеРаботающиеСотрудники = Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("_НеРаботающиеСотрудники").ПолучитьДанные().Выбрать();
		Пока НеРаботающиеСотрудники.Следующий() Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("Сотрудник %1 отсутствует (%2) на %3",
					НеРаботающиеСотрудники.Сотрудник,
					НеРаботающиеСотрудники.Состояние,
					Формат(Дата, "ДФ=dd.MM.yyyy")), НеРаботающиеСотрудники.Сотрудник,,, Отказ);
			Результат = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СотрудникиВходящиеВПеречень(Организация, ВидПеречня, Дата) Экспорт

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидПеречня",	 ВидПеречня);
	Запрос.УстановитьПараметр("Дата",	  	 Дата);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнесениеИзмененийВоВнутреннийПереченьОснования.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ВнутренниеПеречни.СрезПоследних(
		|			&Дата,
		|			Организация = &Организация
		|				И ВидПеречня = &ВидПеречня) КАК ВнутренниеПеречниСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОснованияВнесенияВПеречень.СрезПоследних(
		|				&Дата,
		|				Организация = &Организация
		|					И ВидПеречня = &ВидПеречня) КАК ОснованияВнесенияВПереченьСрезПоследних
		|		ПО ВнутренниеПеречниСрезПоследних.Объект = ОснованияВнесенияВПереченьСрезПоследних.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнесениеИзмененийВоВнутреннийПеречень.Основания КАК ВнесениеИзмененийВоВнутреннийПереченьОснования
		|		ПО (ОснованияВнесенияВПереченьСрезПоследних.Основание = ВнесениеИзмененийВоВнутреннийПереченьОснования.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиОрганизации.СрезПоследних(&Дата, Организация = &Организация) КАК СотрудникиОрганизацииСрезПоследних
		|		ПО (ВнесениеИзмененийВоВнутреннийПереченьОснования.Сотрудник = СотрудникиОрганизацииСрезПоследних.Сотрудник)
		|ГДЕ
		|	ВнутренниеПеречниСрезПоследних.Действует
		|	И СотрудникиОрганизацииСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьРеквизитыСотрудника(Организация, Сотрудник, Дата = Неопределено, Реквизиты) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Сотрудник",	 Сотрудник);
	Запрос.УстановитьПараметр("Дата",		 Дата);
	
#Область ТекстЗапроса
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	Сотрудники.ВидЗанятости КАК ВидЗанятости,
		|	Сотрудники.ЮрФизЛицо КАК ЮрФизЛицо,
		|	Сотрудники.Наименование КАК Наименование,
		|	СотрудникиОрганизацииСрезПоследних.Должность КАК Должность,
		|	СотрудникиОрганизацииСрезПоследних.Должность.Наименование КАК ДолжностьНаименование,
		|	СотрудникиОрганизацииСрезПоследних.Подразделение КАК Подразделение,
		|	СотрудникиОрганизацииСрезПоследних.Подразделение.Наименование КАК ПодразделениеНаименование,
		|	СотрудникиОрганизацииСрезПоследних.Должность.Наименование + "" ("" + СотрудникиОрганизацииСрезПоследних.Подразделение.Наименование + "")"" КАК ДолжностьИПодразделение,
		|	НЕ(СотрудникиОрганизацииСрезПоследних.ВидСобытия ЕСТЬ NULL
		|			ИЛИ СотрудникиОрганизацииСрезПоследних.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)) КАК Работает,
		|	СотрудникиОрганизацииСрезПоследних.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение) КАК Уволен,
		|	СостояниеСотрудниковОрганизацийСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудникаОрганизации.Работа)
		|		ИЛИ СостояниеСотрудниковОрганизацийСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияСотрудникаОрганизации.РаботаВОтпускеПоУходуЗаРебенком) КАК НаходитсяНаРабочемМесте,
		|	СостояниеСотрудниковОрганизацийСрезПоследних.Состояние КАК Состояние,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.Фамилия КАК Фамилия,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.Имя КАК Имя,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.Отчество КАК Отчество,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.Фамилия + "" "" + РеквизитыСотрудниковОрганизацииСрезПоследних.Имя + "" "" + РеквизитыСотрудниковОрганизацииСрезПоследних.Отчество КАК ФИО,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(РеквизитыСотрудниковОрганизацииСрезПоследних.Отчество, 1, 1) = """"
		|			ТОГДА РеквизитыСотрудниковОрганизацииСрезПоследних.Фамилия + "" "" + ПОДСТРОКА(РеквизитыСотрудниковОрганизацииСрезПоследних.Имя, 1, 1) + "".""
		|		ИНАЧЕ РеквизитыСотрудниковОрганизацииСрезПоследних.Фамилия + "" "" + ПОДСТРОКА(РеквизитыСотрудниковОрганизацииСрезПоследних.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыСотрудниковОрганизацииСрезПоследних.Отчество, 1, 1) + "".""
		|	КОНЕЦ КАК ФамилияИнициалы,
		|	ВЫБОР
		|		КОГДА ПОДСТРОКА(РеквизитыСотрудниковОрганизацииСрезПоследних.Отчество, 1, 1) = """"
		|			ТОГДА ПОДСТРОКА(РеквизитыСотрудниковОрганизацииСрезПоследних.Имя, 1, 1) + "". "" + РеквизитыСотрудниковОрганизацииСрезПоследних.Фамилия
		|		ИНАЧЕ ПОДСТРОКА(РеквизитыСотрудниковОрганизацииСрезПоследних.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыСотрудниковОрганизацииСрезПоследних.Отчество, 1, 1) + "". "" + РеквизитыСотрудниковОрганизацииСрезПоследних.Фамилия
		|	КОНЕЦ КАК ИнициалыФамилия,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.Пол КАК Пол,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.ДатаРождения КАК ДатаРождения,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.ИНН КАК ИНН,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.СерияУдостоверенияЛичности КАК СерияУдостоверенияЛичности,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.НомерУдостоверенияЛичности КАК НомерУдостоверенияЛичности,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.ДатаВыдачиУдостоверенияЛичности КАК ДатаВыдачиУдостоверенияЛичности,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.ОрганВыдавшийУдостоверениеЛичности КАК ОрганВыдавшийУдостоверениеЛичности,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.КодОрганаВыдавшегоУдостоверениеЛичности КАК КодОрганаВыдавшегоУдостоверениеЛичности,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.РезидентРФ КАК РезидентРФ,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.Гражданство КАК Гражданство,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.СНИЛС КАК СНИЛС,
		|	РеквизитыСотрудниковОрганизацииСрезПоследних.МестоРождения КАК МестоРождения
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиОрганизации.СрезПоследних(
		|				&Дата,
		|				Организация = &Организация
		|					И Сотрудник = &Сотрудник) КАК СотрудникиОрганизацииСрезПоследних
		|		ПО Сотрудники.Ссылка = СотрудникиОрганизацииСрезПоследних.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеСотрудниковОрганизаций.СрезПоследних(
		|				&Дата,
		|				Организация = &Организация
		|					И Сотрудник = &Сотрудник) КАК СостояниеСотрудниковОрганизацийСрезПоследних
		|		ПО Сотрудники.Ссылка = СостояниеСотрудниковОрганизацийСрезПоследних.Сотрудник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
		|				&Дата,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыСотрудниковОрганизацииСрезПоследних
		|		ПО Сотрудники.ЮрФизЛицо = РеквизитыСотрудниковОрганизацииСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	Сотрудники.Организация = &Организация
		|	И Сотрудники.Ссылка = &Сотрудник";
	
#КонецОбласти	
	
	Выборка = Запрос.Выполнить().Выбрать();
	РеквизитыСотрудника = Новый Структура(Реквизиты);
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыСотрудника, Выборка, Реквизиты);
	КонецЕсли;
	
	Возврат РеквизитыСотрудника;
	
КонецФункции
